Revit 2027 API
Hardwood.HardwoodTintEnabled Property
 The property labeled "Stain" from the "Hardwood" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string HardwoodTintEnabled { get; }
Public Shared ReadOnly Property HardwoodTintEnabled As String
	Get
public:
static property String^ HardwoodTintEnabled {
	String^ get ();
}
static member HardwoodTintEnabled : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "HardwoodTintEnabledType".
See Also
Reference
Hardwood Class
Autodesk.Revit.DB.Visual Namespace